schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
#include "common.h"
#include "mwr_src/function.hpp"
#include "mwr_src/graphical.hpp"
#include "mwr_src/index.h"
#include "mwr_src/index.js.h"
#include "mwr_src/layout.hpp"
// clang-format off
/*****************************************************************************************************************************************************
    MiniWebRadio -- Webradio receiver for ESP32-S3

    first release on 03/2017                                                                                                      */char Version[] ="\
    Version 4.0.4 - 04.10.2025                                                                                                               ";

/*  display (320x240px) with controller ILI9341 or
    display (480x320px) with controller ILI9486 or ILI9488 (SPI) or
    display (800x480px) (RGB-HMI) with TP controller GT911 (I2C)

    SD_MMC is mandatory
    IR remote is optional
    BT Transmitter is optional
    BH1750 (lightsensor) is optional

*****************************************************************************************************************************************************/

// THE SOFTWARE IS PROVIDED "AS IS" FOR PRIVATE USE ONLY, IT IS NOT FOR COMMERCIAL USE IN WHOLE OR PART OR CONCEPT. FOR PERSONAL USE IT IS SUPPLIED
// WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHOR OR COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE

// clang-format on

SET_LOOP_TASK_STACK_SIZE(12 * 1024);

// global variables

char _hl_item[18][40]{"",                    // none
                      "Internet Radio",      // "* интернет-радио *"  "ραδιόφωνο Internet"
                      "Audio Player",        // "** цифрово́й плеер **
                      "DLNA",                // Digital Living Network Alliance
                      "Clock",               // Clock "** часы́ **"  "** ρολόι **"
                      "Brightness",          // Brightness яркость λάμψη
                      "Alarm Clock (hh:mm)", // AlarmClock "будильник" "ξύπνημα"
                      "Off Timer (h:mm)",    // "Sleeptimer" "Χρονομετρητής" "Таймер сна"
                      "Stations List",
                      "Audio Files",
                      "DLNA List",
                      "Bluetooth",
                      "Equalizer",
                      "Settings",
                      "IR Settings",
                      "Alarm",
                      "WiFi Settings", //
                      ""};

constexpr uint16_t MAX_STATIONS = 1000;

settings_s     s_settings;
volume_s       s_volume;
dlnaHistory_s  s_dlnaHistory[10];
timecounter_s  s_timeCounter;
SD_content     s_SD_content;
bt_emitter_s   s_bt_emitter;
tone_s         s_tone;

ps_ptr<char>   s_time_s = "";
ps_ptr<char>   s_myIP;
ps_ptr<char>   s_icyDescription = "";
ps_ptr<char>   s_streamTitle = "";
ps_ptr<char>   s_cur_AudioFolder = "/audiofiles/";
ps_ptr<char>   s_cur_AudioFileName = NULL;
ps_ptr<char>   s_stationURL;
ps_ptr<char>   s_playlistPath;
ps_ptr<char>   s_stationName_air;
ps_ptr<char>   s_homepage = "";
ps_ptr<char>   s_TZName = "Europe/Berlin";
ps_ptr<char>   s_TZString = "CET-1CEST,M3.5.0,M10.5.0/3";
ps_ptr<char>   s_timeSpeechLang = "en";

int8_t         s_currDLNAsrvNr = -1;
uint8_t        s_alarmdays = 0;
uint8_t        s_brightness = 100;   // percent
uint8_t        s_state = UNDEFINED;  // statemaschine
uint8_t        s_cur_Codec = 0;
uint8_t        s_numServers = 0; //
uint8_t        s_level = 0;
uint8_t        s_timeFormat = 24; // 24 or 12
uint8_t        s_sleepMode = 1;   // 0 display off, 1 show the clock
uint8_t        s_staListPos = 0;
uint8_t        s_WiFi_disconnectCnt = 0;
uint8_t        s_reconnectCnt = 0;
uint8_t        s_cthFailCounter = 0; // connecttohost fail
uint8_t        s_itemListPos = 0; // DLNA items
uint8_t        s_fileListPos = 0;
uint8_t        s_radioSubMenue = 0;
uint8_t        s_playerSubMenue = 0;
uint8_t        s_dlnaSubMenue = 0;
uint8_t        s_clockSubMenue = 0;
uint8_t        s_alarmSubMenue = 0;
uint8_t        s_sleepTimerSubMenue = 0;
uint8_t        s_settingsSubMenue = 0;
uint8_t        s_brightnessSubMenue = 0;
uint8_t        s_equalizerSubMenue = 0;
uint8_t        s_ambientValue = 50;
uint8_t        s_dlnaLevel = 0;
uint8_t        s_resetReason = (esp_reset_reason_t)ESP_RST_UNKNOWN;
int16_t        s_totalNumberReturned = -1;
int16_t        s_dlnaMaxItems = -1;
int16_t        s_alarmtime[7] = {0};  // in minutes (23:59 = 23 *60 + 59) [0] Sun, [1] Mon
int16_t        s_cur_AudioFileNr = 0; // this is the position of the file within the (alpha ordered) folder starting with 0
uint16_t       s_staListNr = 0;
uint16_t       s_fileListNr = 0;
uint16_t       s_irNumber = 0;
uint16_t       s_irResult = 0;
uint16_t       s_cur_station = 0;     // current station(nr), will be set later
uint16_t       s_sleeptime = 0;       // time in min until MiniWebRadio goes to sleep
uint16_t       s_plsCurPos = 0;
uint16_t       s_dlnaItemNr = 0;
uint16_t       s_bh1750Value = 50;
uint32_t       s_icyBitRate = 0;      // from http response header via event
uint32_t       s_decoderBitRate = 0;  // from decoder via getBitRate(false)
uint32_t       s_playlistTime = 0; // playlist start time millis() for timeout
uint32_t       s_settingsHash = 0;
uint32_t       s_audioFileSize = 0;
uint32_t       s_media_downloadPort = 0;
uint32_t       s_audioCurrentTime = 0;
uint32_t       s_timestamp = 0;
uint32_t       s_audioFileDuration = 0;
uint64_t       s_totalRuntime = 0; // total runtime in seconds since start

bool           s_btEmitterMode = KCX_BT_Emitter::BT_MODE_EMITTER;
bool           s_f_rtc = false; // true if time from ntp is received
bool           s_f_100ms = false;
bool           s_f_1sec = false;
bool           s_f_10sec = false;
bool           s_f_1min = false;
bool           s_f_mute = false;
bool           s_f_muteIsPressed = false;
bool           s_f_sleeping = false;
bool           s_f_irOnOff = false;
bool           s_f_isWebConnected = false;
bool           s_f_isFSConnected = false;
bool           s_f_eof = false;
bool           s_f_reconnect = false;
bool           s_f_eof_alarm = false;
bool           s_f_alarm = false;
bool           s_f_irNumberSeen = false;
bool           s_f_irResultSeen = false;
bool           s_f_newIcyDescription = false;
bool           s_f_newStreamTitle = false;
bool           s_f_webFailed = false;
bool           s_f_newBitRate = false;
bool           s_f_newStationName = false;
bool           s_f_volBarVisible = false;
bool           s_f_switchToClock = false;   // jump into CLOCK mode at the next opportunity
bool           s_f_timeAnnouncement = true; // time announcement every full hour
bool           s_f_playlistEnabled = false;
bool           s_f_playlistNextFile = false;
bool           s_f_logoUnknown = false;
bool           s_f_pauseResume = false;
bool           s_f_FFatFound = false;
bool           s_f_BH1750_found = false;
bool           s_f_clearLogo = false;
bool           s_f_clearStationName = false;
bool           s_f_shuffle = false;
bool           s_f_dlnaBrowseServer = false;
bool           s_f_dlnaWaitForResponse = false;
bool           s_f_dlnaSeekServer = false;
bool           s_f_dlnaMakePlaylistOTF = false; // notify callback that this browsing was to build a On-The_fly playlist
bool           s_f_dlna_browseReady = false;
bool           s_f_BTEmitterConnected = false;
bool           s_f_brightnessIsChangeable = false;
bool           s_f_connectToLastStation = false;
bool           s_f_msg_box = false;
bool           s_f_esp_restart = false;
bool           s_f_timeSpeech = false;
bool           s_f_stationsChanged = false;
bool           s_f_WiFiConnected = false;

std::deque<ps_ptr<char>> s_PLS_content;
std::deque<ps_ptr<char>> s_logBuffer;

const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "AACP", "OPUS", "OGG", "VORBIS"};

