schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
inline uint16_t txtlen(String str) {
    uint16_t len = 0;
    for (int32_t i = 0; i < str.length(); i++)
        if (str[i] <= 0xC2) len++;
    return len;
}

void showStreamTitle(ps_ptr<char> streamtitle) {
    if (s_f_sleeping) return;

    streamtitle.trim();
    // replacestr(st, " | ", "\n"); // some stations use pipe as \n or
    // replacestr(st, "| ", "\n");
    // replacestr(st, "|", "\n");

    txt_RA_sTitle.setTextColor(TFT_CORNSILK);
    txt_RA_sTitle.writeText(streamtitle.c_get());
}

void showLogoAndStationName(bool force) {
    ps_ptr<char>        SN_utf8;
    ps_ptr<char>        path;
    static ps_ptr<char> old_SN_utf8;
    if (force) { old_SN_utf8.reset(); }

    if (s_cur_station) {
        //    log_w("showLogoAndStationName: %s", staMgnt.getStationName(s_cur_station));
        SN_utf8 = staMgnt.getStationName(s_cur_station);
        SerialPrintfln("Country: ..  " ANSI_ESC_GREEN "%s", staMgnt.getStationCountry(s_cur_station));
    } else {
        SN_utf8 = s_stationName_air;
    }
    SN_utf8.trim();
    if (old_SN_utf8 == SN_utf8) {
        goto exit;
    } else
        old_SN_utf8 = SN_utf8;
    txt_RA_staName.setTextColor(TFT_CYAN);
    txt_RA_staName.setText(SN_utf8.c_get());
    txt_RA_staName.show(true, false);

    path = "/logo/" + SN_utf8 + ".jpg";
    pic_RA_logo.setPicturePath(path.c_get());
    pic_RA_logo.setAlternativPicturePath("/common/unknown.png");
    pic_RA_logo.show(true, false);
exit:
    return;
}

void showFileLogo(uint8_t state) {
    String logo;
    if (state == RADIO) {
        if (s_stationURL.ends_with("m3u8"))
            logo = "/common/" + (String) "M3U8" + ".png";
        else
            logo = "/common/" + (String)codecname[s_cur_Codec] + ".png";
        pic_RA_logo.setPicturePath(logo.c_str());
        pic_RA_logo.setAlternativPicturePath("/common/unknown.png");
        pic_RA_logo.show(true, false);
        webSrv.send("stationLogo=", logo.c_str());
        return;
    } else if (state == DLNA) {
        logo = "/common/DLNA.jpg";
        pic_DL_logo.setPicturePath(logo.c_str());
        pic_DL_logo.setAlternativPicturePath("/common/unknown.png");
        pic_DL_logo.show(true, false);
        webSrv.send("stationLogo=", logo.c_str());
        return;
    }
    if (state == PLAYER) { // s_state PLAYER
        if (s_cur_Codec == 0)
            logo = "/common/AudioPlayer.png";
        else if (s_playerSubMenue == 0)
            logo = "/common/AudioPlayer.png";
        else
            logo = "/common/" + (String)codecname[s_cur_Codec] + ".png";
        pic_PL_logo.setPicturePath(logo.c_str());
        pic_PL_logo.setAlternativPicturePath("/common/unknown.png");
        pic_PL_logo.show(true, false);
        return;
    }
    if (state == SETTINGS) {
        logo = "/common/Settings.png";
        pic_SE_logo.setPicturePath(logo.c_str());
        pic_SE_logo.setAlternativPicturePath("/common/unknown.png");
        pic_SE_logo.show(true, false);
        return;
    }
    if (state == RINGING) {
        logo = "/common/Alarm.png";
        pic_RI_logo.setPicturePath(logo.c_str());
        pic_RI_logo.setAlternativPicturePath("/common/unknown.png");
        pic_RI_logo.show(true, false);
        return;
    }
}

void showFileName(const char* fname) {
    if (!fname) return;
    txt_PL_fName.setTextColor(TFT_CYAN);
    txt_PL_fName.writeText(fname);
}

void showPlsFileNumber() {
    txt_PL_fNumber.setTextColor(TFT_ORANGE);
    char buf[15];
    sprintf(buf, "%03u/%03u", s_plsCurPos, s_PLS_content.size());
    txt_PL_fNumber.writeText(buf);
}

void showAudioFileNumber() {
    txt_PL_fNumber.setTextColor(TFT_ORANGE);
    char buf[15];
    sprintf(buf, "%03u/%03u", s_cur_AudioFileNr + 1, s_SD_content.getSize());
    txt_PL_fNumber.writeText(buf);
}

void display_sleeptime(int8_t ud) { // set sleeptimer
    if (ud == 1) {                  // up
        switch (s_sleeptime) {
            case 0 ... 14: s_sleeptime = (s_sleeptime / 5) * 5 + 5; break;
            case 15 ... 59: s_sleeptime = (s_sleeptime / 15) * 15 + 15; break;
            case 60 ... 359: s_sleeptime = (s_sleeptime / 60) * 60 + 60; break;
            default: s_sleeptime = 360; break; // max 6 hours
        }
    }
    if (ud == -1) { // down
        switch (s_sleeptime) {
            case 1 ... 15: s_sleeptime = ((s_sleeptime - 1) / 5) * 5; break;
            case 16 ... 60: s_sleeptime = ((s_sleeptime - 1) / 15) * 15; break;
            case 61 ... 360: s_sleeptime = ((s_sleeptime - 1) / 60) * 60; break;
            default: s_sleeptime = 0; break; // min
        }
    }
    char tmp[10];
    sprintf(tmp, "%d%02d", s_sleeptime / 60, s_sleeptime % 60);
    char path[128] = "/digits_small/";

    for (uint8_t i = 0; i < 4; i++) {
        strcpy(path, "/digits_small/");
        if (i == 3) {
            if (!s_sleeptime)
                strcat(path, "dsgn.jpg");
            else
                strcat(path, "dsrt.jpg");
        } else {
            strncat(path, (tmp + i), 1);
            if (!s_sleeptime)
                strcat(path, "sgn.jpg");
            else
                strcat(path, "srt.jpg");
        }
        drawImage(path, displayConfig.sleeptimeXPos[i], displayConfig.sleeptimeYPos);
    }
}

boolean drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth, uint16_t maxHeigth) {
    ps_ptr<char> p = path;
    auto         scImg = scaleImage(p);
    if (!SD_MMC.exists(scImg.c_get())) {
        if (scImg.index_of("/.", 0) > 0) return false; // empty filename
        SerialPrintfln("AUDIO_info:  " ANSI_ESC_RED "file \"%s\" not found", scImg);
        return false;
    }
    if (scImg.ends_with("bmp")) { return tft.drawBmpFile(SD_MMC, scImg.c_get(), posX, posY, maxWidth, maxHeigth, 1.0); }
    if (scImg.ends_with("jpg")) { return tft.drawJpgFile(SD_MMC, scImg.c_get(), posX, posY, maxWidth, maxHeigth); }
    if (scImg.ends_with("gif")) { return tft.drawGifFile(SD_MMC, scImg.c_get(), posX, posY, 0); }
    if (scImg.ends_with("png")) { return tft.drawPngFile(SD_MMC, scImg.c_get(), posX, posY); }

