schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    SerialPrintfln(ANSI_ESC_RED "the file \"%s\" contains neither a bmp, a gif nor a jpg graphic", scImg.c_get());
    return false; // neither jpg nor bmp
}
/*****************************************************************************************************************************************************
 *                                                   H A N D L E  A U D I O F I L E                                                                  *
 *****************************************************************************************************************************************************/

boolean isAudio(File file) {
    if (endsWith(file.name(), ".mp3") || endsWith(file.name(), ".aac") || endsWith(file.name(), ".m4a") || endsWith(file.name(), ".wav") || endsWith(file.name(), ".flac") ||
        endsWith(file.name(), ".opus") || endsWith(file.name(), ".ogg")) {
        return true;
    }
    return false;
}

boolean isAudio(const char* path) {
    if (endsWith(path, ".mp3") || endsWith(path, ".aac") || endsWith(path, ".m4a") || endsWith(path, ".wav") || endsWith(path, ".flac") || endsWith(path, ".opus") || endsWith(path, ".ogg")) {
        return true;
    }
    return false;
}

boolean isPlaylist(File file) {
    if (endsWith(file.name(), ".m3u")) { return true; }
    return false;
}

/*****************************************************************************************************************************************************
 *                                                                     P L A Y L I S T                                                               *
 *****************************************************************************************************************************************************/

bool preparePlaylistFromFile(const char* path) {
    s_playlistPath = path;
    if (!s_playlistPath.ends_with(".m3u")) {
        MWR_LOG_ERROR("wrong playlist path %s", s_playlistPath.c_get());
        s_playlistPath.reset();
        return false;
    }

    int idx = s_playlistPath.last_index_of('/');
    s_playlistPath = s_playlistPath.substr(0, idx);

    File playlistFile = SD_MMC.open(path);
    if (!playlistFile) {
        log_e("playlistfile path not found");
        return false;
    }

    if (playlistFile.size() > 1048576) {
        log_e("Playlist too big, size > 1MB");
        playlistFile.close();
        return false;
    }

    s_PLS_content.clear();
    ps_ptr<char> readBuff;
    ps_ptr<char> tmpBuff;

    size_t bytesRead = 0;
    bool   f_EXTINF_seen = false;

    while (playlistFile.available() > 0) {
        readBuff.alloc(2024);
        bytesRead = playlistFile.readBytesUntil('\n', readBuff.get(), readBuff.size());
        if (bytesRead < 5) continue;

        readBuff[bytesRead] = '\0';
        trim(readBuff.get());

        if (readBuff.starts_with("#EXTM3U")) continue;
        if (readBuff.starts_with("#EXTINF:")) {
            tmpBuff = readBuff.substr(8);
            f_EXTINF_seen = true;
            continue;
        }
        if (readBuff.starts_with("#")) continue;

        if (f_EXTINF_seen) {
            f_EXTINF_seen = false;
            readBuff.append("\n");
            readBuff += tmpBuff;
        }
        s_PLS_content.push_back(readBuff);
    }

    playlistFile.close();
    return true;
}
//____________________________________________________________________________________________________________________________________________________

bool preparePlaylistFromSDFolder(const char* path) { // all files within a SD folder
    if (!SD_MMC.exists(path)) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
        return false;
    }
    File folder = SD_MMC.open(path);
    if (!folder.isDirectory()) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
        folder.close();
        return false;
    }
    s_PLS_content.clear(); // clear _PLS_content first

    while (true) { // get content
        File file = folder.openNextFile();
        if (!file) break;
        if (file.isDirectory()) continue;
        if (isAudio(file)) { s_PLS_content.push_back(file.path()); }
        file.close();
    }
    folder.close();

    for (int i = 0; i < s_PLS_content.size(); i++) {
        if (s_PLS_content[i][0] == 2) { // remove ASCII 2
            s_PLS_content[i].remove_before(1, true);
        }
    }

    if (s_f_shuffle)
        sortPlayListRandom();
    else
        sortPlayListAlphabetical();

    return true;
}
//____________________________________________________________________________________________________________________________________________________
bool preparePlaylistFromDLNAFolder() {
    s_PLS_content.clear(); // clear _PLS_content first
    const std::deque<DLNA_Client::srvItem>* foldercontent = &dlna.getBrowseResult();
    for (int i = 0; i < foldercontent->size(); i++) {
        // log_i( "%d : (%d) %s %s -- %s",i, foldercontent.isAudio[i], foldercontent.itemURL[i], foldercontent.title[i], foldercontent.duration[i]);
        if (!foldercontent->at(i).isAudio) continue;
        uint16_t len =
            strlen((const char*)foldercontent->at(i).itemURL.c_get()) + strlen((const char*)foldercontent->at(i).title.c_get()) + strlen((const char*)foldercontent->at(i).duration.c_get()) + 3;
        ps_ptr<char> itstr(len);
        itstr = foldercontent->at(i).itemURL;
        itstr += "\n";
        itstr += foldercontent->at(i).duration;
        itstr += ",";
        itstr += foldercontent->at(i).title;
        MWR_LOG_DEBUG("pushing to playlist : %s", itstr.c_get());
        s_PLS_content.push_back(itstr);
    }
    if (!s_PLS_content.size()) return false;
    MWR_LOG_INFO("pls length %i", s_PLS_content.size());
    return true;
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListAlphabetical() {
    for (int i = 0; i < s_PLS_content.size(); i++) { // easy bubble sort
        for (int j = 1; j < s_PLS_content.size(); j++) {
            if (strcmp(s_PLS_content[j - 1].c_get(), s_PLS_content[i].c_get()) > 0) { swap(s_PLS_content[i], s_PLS_content[j - 1]); }
        }
    }
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListRandom() {
    for (int i = 0; i < s_PLS_content.size(); i++) { // easy bubble sort
        uint16_t randIndex = random(0, s_PLS_content.size());
        s_PLS_content[i].swap(s_PLS_content[randIndex]); // swapping the values
    }
}
//____________________________________________________________________________________________________________________________________________________

void processPlaylist(boolean first) {

    bool         f_hasTitle = false, f_isURL = false, f_isRoot = false, f_isConnected = false;
    ps_ptr<char> playFile, plsContent, plsExtension, duration, title;

    if (s_PLS_content.size() == 0) {
        MWR_LOG_ERROR("playlist is empty");
        return;
    } // guard
    if (s_plsCurPos == s_PLS_content.size()) goto exit; // end of playlist
    if (first) {
        s_plsCurPos = 0;
        s_f_playlistEnabled = true;
    } // reset before start
    MWR_LOG_DEBUG("%s", s_PLS_content[s_plsCurPos].c_get());
    if (s_PLS_content[s_plsCurPos].index_of("\n", 0) > 0) f_hasTitle = true; // has additional infos: duration, title
    // now read from vector _PLS_content
    if (s_PLS_content[s_plsCurPos].starts_with("http")) f_isURL = true;     // is web file
    if (s_PLS_content[s_plsCurPos].starts_with("file://")) f_isRoot = true; // SD file from root
    if (f_hasTitle) {
        int idx = s_PLS_content[s_plsCurPos].index_of("\n", 0);
        plsContent = s_PLS_content[s_plsCurPos].substr(0, idx);
        plsExtension = s_PLS_content[s_plsCurPos].substr(idx + 1);
    } else {
        plsContent = s_PLS_content[s_plsCurPos];
    }
    MWR_LOG_DEBUG("plsContent %s, plsExtension %s", plsContent.c_get(), plsExtension.c_get());
    s_cur_Codec = 0;
    if (f_isURL) { // is web file
        playFile = plsContent;
        connecttohost(playFile.c_get());
        f_isConnected = s_f_isWebConnected;
    } else { // is local file
        if (f_isRoot) {
            playFile = plsContent.substr(7); // skip "file://"
            playFile.urldecode();
            f_isConnected = s_f_isFSConnected;
        } else { // local file, not root
            plsContent.urldecode();
            if (s_playlistPath.valid()) { // path of m3u file
                playFile = s_playlistPath;
                MWR_LOG_DEBUG("playFile %s, plsContent %s", playFile.c_get(), plsContent.c_get());
                if (plsContent[0] != '/') playFile += "/";
                playFile += plsContent;
            } else { // have no playlistpath
                playFile = plsContent;
            }
        }
        connecttoFS("SD_MMC", playFile.c_get());
        f_isConnected = s_f_isFSConnected;
    }
    if (f_isConnected) {
        SerialPrintflnCut("Playlist:    ", ANSI_ESC_YELLOW, playFile.c_get());
        webSrv.send("SD_playFile=", playFile.c_get());
        s_playerSubMenue = 1;
        changeState(PLAYER);
        if (f_hasTitle) {
            int16_t idx1 = plsExtension.index_of(",", 0); // "18,logo-1.mp3"
            duration = plsExtension.substr(0, idx1);
            title = plsExtension.substr(+idx1 + 1);
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "Title: %s", title.c_get());
            showFileName(title.c_get());
        }
    }
    s_plsCurPos++;
    showPlsFileNumber();
    return;

