schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
exit:
    SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "end of playlist");
    webSrv.send("SD_playFile=", "end of playlist");
    s_f_playlistEnabled = false;
    s_playerSubMenue = 0;
    changeState(PLAYER);
    s_plsCurPos = 0;
    return;
}
/*****************************************************************************************************************************************************
 *                                         C O N N E C T   TO   W I F I     /     A C C E S S P O I N T                                              *
 *****************************************************************************************************************************************************/
bool connectToWiFi() {

    ps_ptr<char> line(512);
    if (!line) {
        log_e("oom");
        return false;
    }

    // create nvs entries if they do not exist
    if (!pref.isKey("wifiStr0")) pref.putString("wifiStr0", ""); // SSID + \t + PW
    if (!pref.isKey("wifiStr1")) pref.putString("wifiStr1", "");
    if (!pref.isKey("wifiStr2")) pref.putString("wifiStr2", "");
    if (!pref.isKey("wifiStr3")) pref.putString("wifiStr3", "");
    if (!pref.isKey("wifiStr4")) pref.putString("wifiStr4", "");
    if (!pref.isKey("wifiStr5")) pref.putString("wifiStr5", "");

    const char* SSID = _SSID;
    const char* PW = _PW;
    line[0] = '\0';
    line += SSID;
    line += "\t";
    line += PW;
    pref.putString("wifiStr0", line.c_get());

    for (int i = 0; i < 6; i++) {
        line.clear(); // Move this line outside the switch statement
        switch (i) {
            case 0: line = pref.getString("wifiStr0").c_str(); break;
            case 1: line = pref.getString("wifiStr1").c_str(); break;
            case 2: line = pref.getString("wifiStr2").c_str(); break;
            case 3: line = pref.getString("wifiStr3").c_str(); break;
            case 4: line = pref.getString("wifiStr4").c_str(); break;
            case 5: line = pref.getString("wifiStr5").c_str(); break;
        }
        if (line.strlen() < 5) continue;  // line is empty
        int pos = line.index_of("\t", 0); // find first tab
        if (pos < 0) continue;            // no tab found
        line[pos] = '\0';                 // terminate ssid
        char* ssid = line.get();          // ssid is the first part
        char* pw = line.get() + pos + 1;  // password is the second part
        WiFi.mode(WIFI_STA);
        wifiMulti.addAP(ssid, pw); // SSID and PW in code"
        size_t offset = 0;
        size_t pwlen = strlen(pw);
        size_t dot_len = strlen(emoji.blueCircle); // = 4
        size_t buf_size = pwlen * dot_len + 1;     // +1 für '\0'
        char   pass[buf_size];
        for (size_t j = 0; j < pwlen; j++) {
            memcpy(pass + offset, emoji.blueCircle, dot_len);
            offset += dot_len;
        }
        pass[offset] = '\0'; // Zero-terminate the string
        SerialPrintfln("WiFI_info:   add credentials: " ANSI_ESC_CYAN "%s - %s" ANSI_ESC_YELLOW " [%s:%d]", ssid, pass, __FILENAME__, __LINE__);
    }

    wifiMulti.setStrictMode(true);
    WiFi.mode(WIFI_STA);
    wifiMulti.run();
    SerialPrintfln("WiFI_info:   Connecting WiFi...");
    if (WiFi.isConnected()) {
        WiFi.setAutoReconnect(true);
        if (WIFI_TX_POWER >= 2 && WIFI_TX_POWER <= 21) WiFi.setTxPower((wifi_power_t)(WIFI_TX_POWER * 4));
        return true;
    } else {
        WiFi.mode(WIFI_MODE_NULL);
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "WiFi credentials are not correct");
        return false; // can't connect to any network
    }
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void setWiFiCredentials(const char* ssid, const char* password) {
    if (!ssid || !password) return;
    if (strlen(ssid) < 5) return; // min length

    MWR_LOG_ERROR("ssid %s pw %s", ssid, password);

    ps_ptr<char> line = "";
    ps_ptr<char> credentials;
    int          i = 0, state = 0;

    for (i = 0; i < 6; i++) {
        switch (i) {
            case 0: line = pref.getString("wifiStr0").c_str(); break;
            case 1: line = pref.getString("wifiStr1").c_str(); break;
            case 2: line = pref.getString("wifiStr2").c_str(); break;
            case 3: line = pref.getString("wifiStr3").c_str(); break;
            case 4: line = pref.getString("wifiStr4").c_str(); break;
            case 5: line = pref.getString("wifiStr5").c_str(); break;
        }
         if (line.starts_with(ssid) && line[strlen(ssid)] == '\t') { // ssid found, update password
            credentials = ssid;
            credentials += "\t";
            credentials += password;
            if (i == 0) {
                log_e("password can't changed, is hard coded");
                state = 0;
                goto exit;
            }
            if (i == 1) {
                pref.putString("wifiStr1", credentials.get());
                state = 1;
                goto exit;
            }
            if (i == 2) {
                pref.putString("wifiStr2", credentials.get());
                state = 1;
                goto exit;
            }
            if (i == 3) {
                pref.putString("wifiStr3", credentials.get());
                state = 1;
                goto exit;
            }
            if (i == 4) {
                pref.putString("wifiStr4", credentials.get());
                state = 1;
                goto exit;
            }
            if (i == 5) {
                pref.putString("wifiStr5", credentials.get());
                state = 1;
                goto exit;
            }
        }
    }
    for (i = 1; i < 6; i++) {
        line.clear();
        switch (i) {
            case 1: line = pref.getString("wifiStr1").c_str(); break;
            case 2: line = pref.getString("wifiStr2").c_str(); break;
            case 3: line = pref.getString("wifiStr3").c_str(); break;
            case 4: line = pref.getString("wifiStr4").c_str(); break;
            case 5: line = pref.getString("wifiStr5").c_str(); break;
        }
        if (line.strlen() < 5) { // line is empty
            credentials = ssid;
            credentials += "\t";
            credentials += password;
            if (i == 1) {
                pref.putString("wifiStr1", credentials.get());
                state = 2;
                goto exit;
            }
            if (i == 2) {
                pref.putString("wifiStr2", credentials.get());
                state = 2;
                goto exit;
            }
            if (i == 3) {
                pref.putString("wifiStr3", credentials.get());
                state = 2;
                goto exit;
            }
            if (i == 4) {
                pref.putString("wifiStr4", credentials.get());
                state = 2;
                goto exit;
            }
            if (i == 5) {
                pref.putString("wifiStr5", credentials.get());
                state = 2;
                goto exit;
            }
        }
    }
    state = 3;

