schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
exit:
    if (state == 0) {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "SSID: %s password can't changed, it is hard coded", ssid);
        if (s_f_WiFiConnected) audio.connecttospeech("S S I D and password are hard coded", "en");
    }
    if (state == 1) {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_GREEN "The passord \"%s\" for the SSID: %s has been changed", password, ssid);
        if (s_f_WiFiConnected) audio.connecttospeech("The password has been changed", "en");
    }
    if (state == 2) {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_GREEN "The SSID: %s has been added", ssid);
        if (s_f_WiFiConnected) audio.connecttospeech("The credentials has been added", "en");
    }
    if (state == 3) {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "No more memory to save the credentials for: %s", ssid);
        if (s_f_WiFiConnected) audio.connecttospeech("The S S I D and password can't be stored", "en");
    }
    return;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

/*****************************************************************************************************************************************************
 *                                                                     A U D I O                                                                     *
 *****************************************************************************************************************************************************/
void connecttohost(ps_ptr<char> host) {
    int32_t idx1, idx2;
    ps_ptr<char> url;
    ps_ptr<char> user;
    ps_ptr<char> pwd;

    dispFooter.updateBitRate(0);
    s_cur_Codec = 0;
    //    if(s_state == RADIO) clearStreamTitle();
    s_icyBitRate = 0;
    s_decoderBitRate = 0;
    s_f_webFailed = false;

    idx1 = host.index_of("|", 0);
    if (idx1 == -1) { // no pipe found
        s_f_isWebConnected = audio.connecttohost(host.c_get());

        if (!s_f_isWebConnected) {
            s_cthFailCounter++;
        } else
            (s_cthFailCounter = 0);

        s_f_isFSConnected = false;
        return;
    } else { // pipe found     e.g. http://xxx.com/ext|user|pw
        idx2 = host.index_of("|", idx1 + 1);
        // log_i("idx2 = %i", idx2);
        if (idx2 == -1) { // second pipe not found
            s_f_isWebConnected = audio.connecttohost(host.c_get());

            if (!s_f_isWebConnected) {
                s_cthFailCounter++;
            } else
                (s_cthFailCounter = 0);

            s_f_isFSConnected = false;
            return;
        } else {                       // extract url, user, pwd
            url = host.substr(idx1); // extract url
            user = host.substr(idx1 + 1, idx2 - idx1 - 1);
            pwd = host.substr(idx2 + 1);
            SerialPrintfln("new host: .  %s user %s, pwd %s", url.c_get(), user.c_get(), pwd.c_get());
            s_f_isWebConnected = audio.connecttohost(url.c_get(), user.c_get(), pwd.c_get());
            s_f_isFSConnected = false;
        }
    }
    if (s_cthFailCounter >= 3) {
        audio.connecttospeech("The last hosts were not connected", "en");
        s_settings.lastconnectedhost.assign("");
    }
}
void connecttoFS(const char* FS, const char* filename, uint32_t fileStartTime) {
    if (!filename) return;
    dispFooter.updateBitRate(0);
    s_icyBitRate = 0;
    s_decoderBitRate = 0;
    s_cur_Codec = 0;
    s_f_webFailed = false;
    s_f_isFSConnected = audio.connecttoFS(SD_MMC, filename, fileStartTime);
    s_f_isWebConnected = false;
    if (!startsWith(filename, "/audiofiles/")) { return; }
    if (s_f_isFSConnected && isAudio(filename)) {
        s_settings.lastconnectedfile.copy_from(filename);
        s_SD_content.setLastConnectedFile(filename);
        s_cur_AudioFolder = s_SD_content.getLastConnectedFolder();
        s_cur_AudioFileName = s_SD_content.getLastConnectedFileName();
        s_cur_AudioFileNr = s_SD_content.getPosByFileName(s_cur_AudioFileName.c_get());
        if (s_cur_AudioFileNr == -1) s_cur_AudioFileNr = 0;
    }
    //    log_w("Filesize %d", audioGetFileSize());
    //    log_w("FilePos %d", audioGetFilePosition());
}
void stopSong() {
    audio.stopSong();
    s_f_isFSConnected = false;
    s_f_isWebConnected = false;
    if (s_f_playlistEnabled) {
        s_PLS_content.clear();
        s_f_playlistEnabled = false;
        SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "playlist stopped");
        webSrv.send("SD_playFile=", "playlist stopped");
    }
    s_f_pauseResume = false;
    s_f_playlistNextFile = false;
    s_f_shuffle = false;
    s_playlistPath.reset();
}

/*****************************************************************************************************************************************************
 *                                                                    S E T U P                                                                      *
 *****************************************************************************************************************************************************/

void setup() {
    Audio::audio_info_callback = my_audio_info; // audio callback
    dlna.dlna_client_callbak(on_dlna_client);   // dlna callback
    bt_emitter.kcx_bt_emitter_callback(on_kcx_bt_emitter);
    webSrv.websrv_callbak(on_websrv);
    esp_log_level_set("*", ESP_LOG_DEBUG);
    esp_log_set_vprintf(log_redirect_handler);
    Serial.begin(MONITOR_SPEED);
    vTaskDelay(1500); // wait for serial terminal is ready
    mutex_rtc = xSemaphoreCreateMutex();
    mutex_display = xSemaphoreCreateMutex();
    Serial.print("\n\n");
    trim(Version);

    Serial.println("             " ANSI_ESC_BG_MAGENTA " ***************************************************** " ANSI_ESC_RESET "   ");
    Serial.printf("             " ANSI_ESC_BG_MAGENTA " *     MiniWebRadio % 29s    * " ANSI_ESC_RESET "    \n", Version);
    Serial.println("             " ANSI_ESC_BG_MAGENTA " ***************************************************** " ANSI_ESC_RESET "    ");
    Serial.println(ANSI_ESC_RESET "   ");

