schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if (I2C_SCL < 0) {
        s_f_BH1750_found = BH1750.begin(BH1750.ADDR_TO_GROUND, I2C_SDA, I2C_SCL); // init the sensor with address pin connetcted to ground
    }
    if (s_f_BH1750_found) { // result (bool) wil be be "false" if no sensor found
        SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "Ambient Light Sensor BH1750 found");
        BH1750.setResolutionMode(BH1750.ONE_TIME_H_RESOLUTION_MODE);
        BH1750.setSensitivity(BH1750.SENSITIVITY_ADJ_MAX);
    }
    ticker100ms.attach(0.1, timer100ms);
#if TFT_CONTROLLER == 7
    tft.clearVsyncCounter(); // clear the vsync counter and start them
#endif

    tft.fillScreen(TFT_BLACK);                                                          // Clear screen
    drawImage("/common/Wallpaper.jpg", 0, 0);                                           // Wallpaper
    tft.copyFramebuffer(0, 1, 0, 0, displayConfig.dispWidth, displayConfig.dispHeight); // copy wallpaper to background
    muteChanged(s_f_mute);
    dispFooter.setIpAddr(WiFi.localIP().toString().c_str());
    dispFooter.updateStation(s_cur_station);
    dispFooter.updateOffTime(s_sleeptime);
    dispFooter.show(true);

    dispHeader.updateItem(_hl_item[RADIO]);
    dispHeader.updateVolume(s_volume.cur_volume);
    dispHeader.speakerOnOff(!s_f_mute);
    dispHeader.show(true);
    s_radioSubMenue = 0;
    s_state = NONE;
    if (s_f_WiFiConnected) {
        changeState(RADIO);
    } else {
        changeState(WIFI_SETTINGS);
    }

    bt_emitter.begin();
    bt_emitter.userCommand("AT+GMR?");                 // get version
    bt_emitter.userCommand("AT+PAUSE?");               // pause or play?
    bt_emitter.userCommand("AT+NAME+BT-MiniWebRadio"); // set BT receiver name
    bt_emitter.setVolume(s_bt_emitter.volume);
    bt_emitter.setMode(s_bt_emitter.mode);
}
/*****************************************************************************************************************************************************
 *                                                                   C O M M O N                                                                     *
 *****************************************************************************************************************************************************/

ps_ptr<char> scaleImage(ps_ptr<char> path) {
    MWR_LOG_DEBUG("path %s", path.c_get());
    bool ok = false;
    if (path.ends_with("bmp")) ok = true;
    if (path.ends_with("jpg")) ok = true;
    if (path.ends_with("gif")) ok = true;
    if (path.ends_with("png")) ok = true;
    if (path.starts_with("/png")) ok = false; // is web button
    if (!ok) return path;

    int idx = path.index_of('/', 1);
    if (idx < 0) return path; // invalid path

    char prefix[03] = " /";
    prefix[0] = displayConfig.tftSize;

    path.insert(prefix, idx + 1); // "/logo/0N 90s.jpg" --> "/logo/s/0N 90s.jpg"
    MWR_LOG_DEBUG("path %s", path.c_get());
    return path;
}

void setVolume(uint8_t vol) {
    static int16_t oldVol = -1;
    if (vol == oldVol) return;
    log_i("volume old: %i. new: %i", oldVol, vol);
    s_volume.cur_volume = vol;
    oldVol = vol;
    dispHeader.updateVolume(s_volume.cur_volume);
    sdr_CL_volume.setValue(s_volume.cur_volume);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    SerialPrintfln("action: ...  current volume is " ANSI_ESC_CYAN "%d", s_volume.cur_volume);
}

uint8_t downvolume() {
    uint8_t steps = s_volume.volumeSteps / 20;
    if (s_volume.cur_volume == 0)
        return s_volume.cur_volume;
    else if (steps < s_volume.cur_volume)
        s_volume.cur_volume -= steps;
    else
        s_volume.cur_volume--;
    sdr_CL_volume.setValue(s_volume.cur_volume);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    s_f_mute = false;
    muteChanged(s_f_mute); // set mute off
    return s_volume.cur_volume;
}

uint8_t upvolume() {
    uint8_t steps = s_volume.volumeSteps / 20;
    if (s_volume.cur_volume == s_volume.volumeSteps)
        return s_volume.cur_volume;
    else if (s_volume.volumeSteps > s_volume.cur_volume + steps)
        s_volume.cur_volume += steps;
    else
        s_volume.cur_volume++;
    sdr_CL_volume.setValue(s_volume.cur_volume);
    sdr_DL_volume.setValue(s_volume.cur_volume);
    sdr_PL_volume.setValue(s_volume.cur_volume);
    sdr_RA_volume.setValue(s_volume.cur_volume);
    s_f_mute = false;
    muteChanged(s_f_mute); // set mute off
    return s_volume.cur_volume;
}

void setStation(uint16_t sta) {
    static uint16_t old_cur_station = 0;
    if (sta == 0) { return; }
    if (sta > staMgnt.getSumStations()) sta = s_cur_station;
    s_stationURL = staMgnt.getStationUrl(sta);
    s_homepage = "";
    SerialPrintfln("action: ...  switch to station " ANSI_ESC_CYAN "%d", sta);

    if (s_f_isWebConnected && sta == old_cur_station && s_state == RADIO) { // Station is already selected
        s_f_newStreamTitle = true;
    } else {
        if (s_state != RADIO) {
            s_radioSubMenue = 0;
            changeState(RADIO);
        }
        s_streamTitle = "";
        s_icyDescription = "";
        s_f_newStreamTitle = true;
        s_f_newIcyDescription = true;
        connecttohost(s_stationURL.c_get());
        //    if(!s_f_isWebConnected) s_cur_station = old_cur_station; // host is not connected
    }
    old_cur_station = sta;
    StationsItems();
    if (s_state == RADIO) {
        showLogoAndStationName(true);
        if (s_cur_station == 0) {
            dispFooter.updateFlag(NULL);
        } else {
            dispFooter.updateFlag(getFlagPath(s_cur_station));
        }
    }
    dispFooter.updateStation(s_cur_station);
}
const char* getFlagPath(uint16_t station) {
    static char flagPath[40];
    flagPath[0] = '\0';
    strcpy(flagPath, "/flags/");
    strcat(flagPath, staMgnt.getStationCountry(station));
    for (int i = 0; i < strlen(flagPath); i++) flagPath[i] = tolower(flagPath[i]);
    strcat(flagPath, ".jpg");
    return flagPath;
}

