schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void nextStation() {
    setStation(staMgnt.nextStation());
}
void nextFavStation() {
    setStation(staMgnt.nextFavStation());
}
void prevStation() {
    setStation(staMgnt.prevStation());
}
void prevFavStation() {
    setStation(staMgnt.prevFavStation());
}
void setStationByNumber(uint16_t staNr) {
    setStation(staMgnt.setStationByNumber(staNr));
}

void StationsItems() {
    ps_ptr<char> stationLogo_air = "/logo/" + s_stationName_air + ".jpg";
    char         staNr[10];
    itoa(s_cur_station, staNr, 10);

    if (s_cur_station == 0) {
        webSrv.send("stationLogo=", stationLogo_air.c_get());
        webSrv.send("stationNr=", staNr);
        webSrv.send("stationURL=", s_settings.lastconnectedhost.get());
    } else {
        ps_ptr<char>sn; sn.assignf("/logo/%s.jpg", staMgnt.getStationName(s_cur_station));
        webSrv.send("stationLogo=", sn);
        webSrv.send("stationNr=", staNr);
        if (s_stationURL.valid()) {
            s_stationURL.insert("stationURL=", 0);
            webSrv.send(s_stationURL.get());
        }
    }
}

void setStationViaURL(const char* url, const char* extension) {
    // e.g.  http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one&bitrate=96000
    // url is http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one, extension is bitrate=96000
    s_stationName_air.reset();

    s_cur_station = 0;
    int   len_url = strlen(url) + strlen(extension) + 3;
    char* origin_url = (char*)calloc(1, len_url);
    if (strlen(extension) > 0) {
        strcpy(origin_url, url);
        strcat(origin_url, "&");
        strcat(origin_url, extension);
    } else {
        strcpy(origin_url, url);
    }
    s_stationURL = origin_url;
    connecttohost(origin_url);
    StationsItems();
    if (s_state == RADIO) {
        clearStreamTitle();
        showLogoAndStationName(true);
        dispFooter.updateFlag(NULL);
    }
    dispFooter.updateStation(0); // set 000
}

void savefile(const char* fileName, uint32_t contentLength) { // save the uploadfile on SD_MMC
    char fn[256];
    if (!startsWith(fileName, "/")) {
        strcpy(fn, "/");
        strcat(fn, fileName);
    } else {
        strcpy(fn, fileName);
    }
    if (webSrv.uploadfile(SD_MMC, fn, contentLength)) {
        SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
        webSrv.sendStatus(200);
    } else {
        SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD failed", fn);
        webSrv.sendStatus(400);
    }
}

void saveImage(const char* fileName, uint32_t contentLength) { // save the jpg image on SD_MMC
    char fn[256];

    if (endsWith(fileName, "jpg")) {
        strcpy(fn, "/logo/");
        char prefix[03] = " /";
        prefix[0] = displayConfig.tftSize;
        strcat(fn, prefix);
        if (!startsWith(fileName, "/")) strcat(fn, "/");
        strcat(fn, fileName);
        if (webSrv.uploadB64image(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save image (jpg) " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        } else
            webSrv.sendStatus(400);
    }
}

ps_ptr<char> setI2STone() {
    ps_ptr<char> tone;
    audio.setTone(s_tone.LP, s_tone.BP, s_tone.HP);
    audio.setBalance(s_tone.BAL);
    tone.assignf("LowPass=%i\nBandPass=%i\nHighPass=%i\nBalance=%i\n", s_tone.LP, s_tone.BP, s_tone.HP, s_tone.BAL);
    return tone;
}

void SD_playFile(ps_ptr<char> pathWoFileName, const char* fileName) { // pathWithoutFileName e.g. /audiofiles/playlist/
    pathWoFileName += fileName;
    int32_t idx = pathWoFileName.index_of("\033[", 1);
    if (idx == -1) { // do nothing
        SD_playFile(pathWoFileName, 0, true);
        return;
    }
    SD_playFile(pathWoFileName.substr(0, idx), 0, true); // remove color and filesize
    return;
}

void SD_playFile(ps_ptr<char> path, uint32_t fileStartTime, bool showFN) {
    if (!path) return; // avoid a possible crash
    ps_ptr<char> audiopath = path;
    if (audiopath.ends_with("m3u")) {
        if (SD_MMC.exists(path.c_get())) {
            preparePlaylistFromFile(path.c_get());
            processPlaylist(true);
        }
        return;
    }
    if (s_playerSubMenue != 1 && s_playerSubMenue != 3) {
        s_playerSubMenue = 1;
        changeState(PLAYER);
    }
    int32_t idx = path.last_index_of('/');
    if (idx < 0) return;
    s_cur_AudioFolder = audiopath.substr(0, idx);

    if (showFN) {
        clearLogo();
        showFileName(path.c_get() + idx + 1);
    }

    SerialPrintfln("AUDIO_FILE:  " ANSI_ESC_MAGENTA "%s", path.c_get() + idx + 1);
    connecttoFS("SD_MMC", (const char*)path.c_get(), fileStartTime);
    if (s_f_playlistEnabled) showPlsFileNumber();
    if (s_f_isFSConnected) { s_settings.lastconnectedfile = path; }
}

bool SD_rename(const char* src, const char* dest) {
    bool success = false;
    if (SD_MMC.exists(src)) {
        log_i("exists");
        success = SD_MMC.rename(src, dest);
    }
    return success;
}

bool SD_newFolder(const char* folderPathName) {
    bool success = false;
    success = SD_MMC.mkdir(folderPathName);
    return success;
}

bool SD_delete(const char* itemPath) {
    bool success = false;
    if (SD_MMC.exists(itemPath)) {
        File dirTest = SD_MMC.open(itemPath, "r");
        bool isDir = dirTest.isDirectory();
        dirTest.close();
        if (isDir)
            success = SD_MMC.rmdir(itemPath);
        else
            success = SD_MMC.remove(itemPath);
    }
    return success;
}

void fall_asleep() {
    s_f_sleeping = true;
    s_f_mute = true;
    s_f_playlistEnabled = false;
    s_f_isFSConnected = false;
    s_f_isWebConnected = false;
    audio.stopSong();
    if (s_sleepMode == 0) {
        clearAll();
        setTFTbrightness(0);
    } else {
        s_clockSubMenue = 0;
        changeState(CLOCK);
    }
    if (s_bt_emitter.power_state) bt_emitter.power_off();
    SerialPrintfln("falling asleep");
    dispHeader.hide();
    dispFooter.hide();
}

