schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void wake_up() {
    s_f_sleeping = false;
    s_f_mute = false;
    s_f_irOnOff = false;
    SerialPrintfln("awake");
    s_f_mute = true;
    muteChanged(false);
    clearAll();
    setTFTbrightness(s_brightness);
    if (s_cur_station)
        setStation(s_cur_station);
    else
        connecttohost(s_settings.lastconnectedhost.get());
    s_radioSubMenue = 0;
    changeState(RADIO);
    showLogoAndStationName(true);
    dispHeader.show(true);
    dispHeader.speakerOnOff(!s_f_mute);
    dispHeader.updateRSSI(WiFi.RSSI(), true);
    dispFooter.show(true);
    if (!s_bt_emitter.power_state) bt_emitter.power_on();
}

void setRTC(ps_ptr<char> TZString) {
    rtc.stop();
    rtc.begin(TZString.c_get());
    // if(!s_f_rtc) {
    //     SerialPrintfln(ANSI_ESC_RED "connection to NTP failed, trying again");
    //     ESP.restart();
    // }
}

boolean isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime) {
    uint8_t mask = 0b00000001 << weekDay;
    if (alarmDays & mask) {                         // yes, is alarmDay
        if (alarmTime[weekDay] == minuteOfTheDay) { // yes, is alarmTime
            return true;
        }
    }
    return false;
}

boolean copySDtoFFat(const char* path) {
    if (!s_f_FFatFound) return false;
    uint8_t buffer[1024];
    size_t  r = 0, w = 0;
    size_t  len = 0;
    File    file1 = SD_MMC.open(path, "r");
    File    file2 = FFat.open(path, "w");
    while (true) {
        r = file1.read(buffer, 1024);
        w = file2.write(buffer, r);
        if (r != w) {
            file1.close();
            file2.close();
            FFat.remove(path);
            return false;
        }
        len += r;
        if (r == 0) break;
    }
    log_i("file length %i, written %i", file1.size(), len);
    if (file1.size() == len) return true;
    return false;
}

void muteChanged(bool m) {
    s_f_muteIsPressed = false;
    btn_CL_mute.setValue(m);
    btn_DL_mute.setValue(m);
    btn_EQ_mute.setValue(m);
    btn_PL_mute.setValue(m);
    btn_RA_mute.setValue(m);
    if (m) {
        s_f_mute = true;
    } else {
        s_f_mute = false;
    }
    if (m)
        webSrv.send("mute=", "1");
    else
        webSrv.send("mute=", "0");
    dispHeader.speakerOnOff(!s_f_mute);
    dispHeader.updateVolume(s_volume.cur_volume);
    updateSettings();
};

void logAlarmItems() {
    const char wd[7][11] = {"Sunday:   ", "Monday:   ", "Tuesday:  ", "Wednesday:", "Thursday: ", "Friday:   ", "Saturday: "};
    uint8_t    mask = 0b00000001;
    for (uint8_t i = 0; i < 7; i++) {
        if (s_alarmdays & mask) {
            SerialPrintfln("AlarmTime:   " ANSI_ESC_YELLOW "%s " ANSI_ESC_CYAN "%02i:%02i", wd[i], s_alarmtime[i] / 60, s_alarmtime[i] % 60);
        } else {
            SerialPrintfln("AlarmTime:   " ANSI_ESC_YELLOW "%s No alarm is set", wd[i]);
        }
        mask <<= 1;
    }
}

void setTimeCounter(uint8_t sec) {
    if (sec) {
        s_timeCounter.timer = 10;
        s_timeCounter.factor = sec;
    } else {
        s_timeCounter.timer = 0;
        s_timeCounter.factor = 0;
        dispFooter.updateTC(0);
    }
}

// clang-format off

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                              C H A N G E    S T A T E                                                                       ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format on
void changeState(int32_t state) {
    disableAllObjects();
    s_f_volBarVisible = false;
    if (s_timeCounter.timer) { setTimeCounter(0); }
    dispFooter.enable();
    dispHeader.enable();
    dispHeader.updateItem(_hl_item[state]);
    if (state != RADIO) { dispFooter.updateFlag(NULL); }
    switch (state) {
        case RADIO: {
            dispHeader.show(true);
            dispFooter.show(true);
            if (s_state != RADIO) {
                clearWithOutHeaderFooter();
                dispFooter.updateFlag(getFlagPath(s_cur_station));
            }
            txt_RA_staName.enable();
            pic_RA_logo.enable();
            if (s_radioSubMenue == 0) {
                if (s_f_irResultSeen) {
                    txt_RA_irNum.hide();
                    setStationByNumber(s_irResult);
                    s_f_irResultSeen = false;
                } // ir_number, valid between 1 ... 999
                if (s_state != RADIO) { showLogoAndStationName(true); }
                setTimeCounter(0);
                VUmeter_RA.show(true);
                txt_RA_sTitle.setText("");
                txt_RA_sTitle.show(true, false);
                s_f_newStreamTitle = true;
            }
            if (s_radioSubMenue == 1) { // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                clearTitle();
                txt_RA_sTitle.disable();
                sdr_RA_volume.show(true, false);
                btn_RA_mute.show();
                btn_RA_prevSta.show();
                btn_RA_nextSta.show();
                //    txt_RA_staName.show(true, false);
                setTimeCounter(2);
            }
            if (s_radioSubMenue == 2) { // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                btn_RA_staList.show();
                btn_RA_player.show();
                btn_RA_dlna.show();
                btn_RA_clock.show();
                btn_RA_sleep.show();
                btn_RA_settings.show();
                btn_RA_bt.show(!s_bt_emitter.found);
                btn_RA_off.show();
                setTimeCounter(2);
            }
            if (s_radioSubMenue == 3) { // show Numbers from IR
                char buf[10];
                itoa(s_irNumber, buf, 10);
                txt_RA_irNum.setText(buf);
                txt_RA_irNum.show(true, false);
                setTimeCounter(1);
            }
            if (s_radioSubMenue == 4) { // IR select mode
                clearTitle();
                txt_RA_sTitle.disable();
                btn_RA_staList.showAlternativePic();
                btn_RA_player.show();
                btn_RA_dlna.show();
                btn_RA_clock.show();
                btn_RA_sleep.show();
                btn_RA_settings.show();
                btn_RA_bt.show(!s_bt_emitter.found);
                btn_RA_off.show();
                setTimeCounter(2);
            }
            if (s_state != RADIO) webSrv.send("changeState=", "RADIO");
            break;
        }

        case STATIONSLIST: {
            dispHeader.show(false);
            dispFooter.show(false);
            clearWithOutHeaderFooter();
            lst_RADIO.show();
            setTimeCounter(LIST_TIMER);
            break;
        }

        case PLAYER: {
            dispHeader.show(true);
            dispFooter.show(true);
            if (s_state != PLAYER) clearWithOutHeaderFooter();
            pic_PL_logo.enable();
            if (s_playerSubMenue == 0) { // prev, next, ready, play_all, shuffle, list, radio, off
                s_SD_content.listFilesInDir(s_cur_AudioFolder.c_get(), true, false);
                s_cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                txt_PL_fName.show(true, false);
                pgb_PL_progress.hide();
                sdr_PL_volume.disable();
                if (s_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                txt_PL_fNumber.show(true, false);
                showAudioFileNumber();
                btn_PL_prevFile.show();
                btn_PL_nextFile.show();
                btn_PL_ready.show();
                btn_PL_playAll.show();
                btn_PL_shuffle.show();
                btn_PL_fileList.show();
                btn_PL_radio.show();
                btn_PL_off.show();
            }
            if (s_playerSubMenue == 1) {
                btn_PL_fileList.hide();
                btn_PL_radio.hide();
                btn_PL_off.hide();
                pgb_PL_progress.setValue(0);
                pgb_PL_progress.show(true, false);
                sdr_PL_volume.show(true, false);
                showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                txt_PL_fName.show(true, false);
                txt_PL_fNumber.show(true, false);
                btn_PL_mute.show();
                btn_PL_pause.setOff();
                btn_PL_pause.show();
                btn_PL_cancel.show();
                btn_PL_playPrev.show();
                btn_PL_playNext.show();
            }
            if (s_playerSubMenue == 2) { // same as submenue 0 for IR
                s_SD_content.listFilesInDir(s_cur_AudioFolder.c_get(), true, false);
                s_cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                txt_PL_fName.show(true, false);
                pgb_PL_progress.hide();
                if (s_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                txt_PL_fNumber.show(true, false);
                showAudioFileNumber();
                btn_PL_prevFile.showAlternativePic();
                btn_PL_nextFile.show();
                btn_PL_ready.show();
                btn_PL_playAll.show();
                btn_PL_shuffle.show();
                btn_PL_fileList.show();
                btn_PL_radio.show();
                btn_PL_off.show();
            }
            if (s_playerSubMenue == 3) { // same as submenue 1 for IR
                btn_PL_fileList.hide();
                btn_PL_radio.hide();
                btn_PL_off.hide();
                pgb_PL_progress.setValue(0);
                pgb_PL_progress.show(true, false);
                sdr_PL_volume.show(true, false);
                showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                txt_PL_fName.show(true, false);
                txt_PL_fNumber.show(true, false);
                btn_PL_mute.showAlternativePic();
                btn_PL_pause.setOff();
                btn_PL_pause.show();
                btn_PL_cancel.show();
                btn_PL_playPrev.show();
                btn_PL_playNext.show();
            }
            break;
        }
        case AUDIOFILESLIST: {
            dispHeader.show(false);
            dispFooter.show(false);
            clearWithOutHeaderFooter();
            lst_PLAYER.show(s_cur_AudioFolder, s_cur_AudioFileNr);
            setTimeCounter(LIST_TIMER);
            break;
        }
        case DLNA: {
            dispHeader.show(true);
            dispFooter.show(true);
            if (s_state != DLNA) {
                if (s_state != DLNAITEMSLIST) audio.stopSong();
                clearWithOutHeaderFooter();
                pic_DL_logo.enable();
                pgb_DL_progress.setValue(0);
                pgb_DL_progress.show(true, false);
                txt_DL_fName.show(true, false);
                showFileLogo(DLNA);
            }
            if (s_dlnaSubMenue == 0) { // TP submenu
                if (audio.isRunning())
                    btn_DL_pause.setActive(true);
                else
                    btn_DL_pause.setActive(false);
                btn_DL_pause.show();
                sdr_DL_volume.show(true, false);
                btn_DL_mute.show();
                btn_DL_cancel.show();
                btn_DL_fileList.show();
                btn_DL_radio.show();
            }
            if (s_dlnaSubMenue == 1) { // IR submenu
                if (audio.isRunning())
                    btn_DL_pause.setActive(true);
                else
                    btn_DL_pause.setActive(false);
                btn_DL_pause.show();
                sdr_DL_volume.show(true, false);
                btn_DL_mute.showAlternativePic();
                btn_DL_cancel.show();
                btn_DL_fileList.show();
                btn_DL_radio.show();
            }
            if (s_state != DLNA) webSrv.send("changeState=", "DLNA");
            break;
        }
        case DLNAITEMSLIST: {
            dispHeader.show(false);
            dispFooter.show(false);
            lst_DLNA.show(s_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &s_dlnaLevel, s_dlnaMaxItems);
            setTimeCounter(LIST_TIMER);
            break;
        }
        case CLOCK: {
            dispHeader.show(false);
            dispFooter.show(false);
            if (s_state != CLOCK) { bgColorWithOutHeaderFooter(); }
            if (s_timeFormat == 24)
                clk_CL_24.show();
            else
                clk_CL_12.show();
            if (s_clockSubMenue == 0) {
                btn_CL_mute.hide();
                btn_CL_alarm.hide();
                btn_CL_radio.hide();
                sdr_CL_volume.disable();
                btn_CL_off.hide();
            }
            if (s_clockSubMenue == 1) {
                setTimeCounter(2);
                btn_CL_mute.show();
                btn_CL_alarm.show();
                btn_CL_radio.show();
                sdr_CL_volume.show(false, false);
                btn_CL_off.show();
            }
            if (s_clockSubMenue == 2) { // same as s_clockSubMenue 1 for IR
                setTimeCounter(2);
                btn_CL_alarm.showAlternativePic();
                btn_CL_radio.show();
                btn_CL_mute.show();
                btn_CL_off.show();
                sdr_CL_volume.show(false, false);
            }
            break;
        }
        case ALARMCLOCK: {
            dispHeader.show(false);
            dispFooter.show(false);
            if (s_state != ALARMCLOCK) bgColorWithOutHeaderFooter();
            if (s_alarmSubMenue == 0) {
                btn_AC_left.show();
                btn_AC_right.show();
                btn_AC_up.show();
                btn_AC_down.show();
                btn_AC_ready.show();
                clk_AC_red.show();
            }
            if (s_alarmSubMenue == 1) { // same as s_alarmSubMenue for IR
                setTimeCounter(2);
                btn_AC_left.showAlternativePic();
                btn_AC_right.show();
                btn_AC_up.show();
                btn_AC_down.show();
                btn_AC_ready.show();
                clk_AC_red.show();
            }
            break;
        }
        case SLEEPTIMER: {
            dispHeader.show(true);
            dispFooter.show(true);
            if (s_state != SLEEPTIMER) {
                clearWithOutHeaderFooter();
                display_sleeptime();
                if (TFT_CONTROLLER < 2)
                    drawImage("/common/Night_Gown.bmp", 198, 23);
                else if (TFT_CONTROLLER < 7)
                    drawImage("/common/Night_Gown.bmp", 280, 45);
                else
                    drawImage("/common/Night_Gown.jpg", 482, 112);
            }
            if (s_sleepTimerSubMenue == 0) {
                btn_SL_up.show();
                btn_SL_down.show();
                btn_SL_ready.show();
                btn_SL_cancel.show();
            }
            if (s_sleepTimerSubMenue == 1) {
                btn_SL_up.showAlternativePic();
                btn_SL_down.show();
                btn_SL_ready.show();
                btn_SL_cancel.show();
            }
            break;
        }
        case SETTINGS: {
            dispHeader.show(true);
            dispFooter.show(true);
            if (s_state != SETTINGS) {
                clearWithOutHeaderFooter();
                showFileLogo(SETTINGS);
            }
            if (s_settingsSubMenue == 0) {
                btn_SE_bright.show(!s_f_brightnessIsChangeable);
                btn_SE_equal.show();
                btn_SE_wifi.show();
                btn_SE_radio.show();
            }
            if (s_settingsSubMenue == 1) {
                btn_SE_bright.showAlternativePic(!s_f_brightnessIsChangeable);
                btn_SE_equal.show();
                btn_SE_wifi.show();
                btn_SE_radio.show();
            }
            break;
        }
        case BRIGHTNESS: {
            dispHeader.show(false);
            dispFooter.show(false);
            if (s_state != BRIGHTNESS) {
                clearWithOutHeaderFooter();
                pic_BR_logo.show(true, false);
            }
            sdr_BR_value.show(true, true);
            txt_BR_value.setText(int2str(s_brightness));
            txt_BR_value.show(true, true);
            if (s_brightnessSubMenue == 0) { btn_BR_ready.show(); }
            if (s_brightnessSubMenue == 1) { // same as s_brightnessSubMenue for IR
                btn_BR_ready.showAlternativePic();
            }
            break;
        }
        case EQUALIZER:
            dispHeader.show(true);
            dispFooter.show(true);
            if (s_state != EQUALIZER) clearWithOutHeaderFooter();
            sdr_EQ_lowPass.show(true, false);
            sdr_EQ_bandPass.show(true, false);
            sdr_EQ_highPass.show(true, false);
            sdr_EQ_balance.show(true, false);
            btn_EQ_lowPass.show();
            btn_EQ_bandPass.show();
            btn_EQ_highPass.show();
            btn_EQ_balance.show();
            btn_EQ_Player.show();
            btn_EQ_mute.show();
            txt_EQ_lowPass.show(true, false);
            txt_EQ_bandPass.show(true, false);
            txt_EQ_highPass.show(true, false);
            txt_EQ_balance.show(true, false);
            if (s_equalizerSubMenue == 0) { btn_EQ_Radio.show(); }
            if (s_equalizerSubMenue == 1) { btn_EQ_Radio.showAlternativePic(); }

            break;

        case BLUETOOTH: {
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            btn_BT_volUp.show();
            btn_BT_volDown.show();
            btn_BT_pause.show();
            btn_BT_mode.show();
            btn_BT_radio.show();
            btn_BT_power.show();
            pic_BT_mode.show(true, false);
            if (s_bt_emitter.mode.equals("RX")) {
                txt_BT_mode.writeText("RECEIVER");
            } else {
                txt_BT_mode.writeText("EMITTER");
            }
            txt_BT_mode.setBGcolor(TFT_BROWN);
            txt_BT_mode.show(true, false);
            char c[10];
            sprintf(c, "Vol: %02i", bt_emitter.getVolume());
            txt_BT_volume.writeText(c);
            txt_BT_volume.show(true, false);
            if (s_state != BLUETOOTH) webSrv.send("changeState=", "BLUETOOTH");
            break;
        }
        case IR_SETTINGS:
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            btn_IR_radio.show();
            break;

        case RINGING:
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            if (s_volume.ringVolume > 0) { // alarm with bell
                pic_RI_logo.enable();
                showFileLogo(RINGING);
                setTFTbrightness(s_brightness);
                SerialPrintfln(ANSI_ESC_MAGENTA "Alarm");
                setVolume(s_volume.ringVolume);
                audio.setVolume(s_volume.ringVolume, s_volume.volumeCurve);
                muteChanged(false);
                connecttoFS("SD_MMC", "/ring/alarm_clock.mp3");
                clk_RI_24small.show();
            } else { // alarm without bell
                s_f_eof_alarm = true;
            }
            break;

        case WIFI_SETTINGS:
            dispHeader.show(true);
            dispFooter.show(true);
            clearWithOutHeaderFooter();
            cls_wifiSettings.clearText();
            cls_wifiSettings.setBorderWidth(1);
            cls_wifiSettings.setFontSize(displayConfig.listFontSize);
            int16_t n = WiFi.scanNetworks();
            SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "%i WiFi networks found", n);
            for (int i = 0; i < n; i++) {
                SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
                ps_ptr<char> pw = get_WiFi_PW(WiFi.SSID(i).c_str());
                // if(pw){log_e("found password %s for %s", pw, WiFi.SSID(i).c_str());}
                // else  {log_e("no password found for %s", WiFi.SSID(i).c_str());}
                cls_wifiSettings.add_WiFi_Items(WiFi.SSID(i).c_str(), pw.c_get());

