schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
            }
            cls_wifiSettings.show(false, false);
            break;
    }
    s_state = state;
}
// clang-format on

ps_ptr<char> get_WiFi_PW(const char* ssid) {
    ps_ptr<char> line;
    ps_ptr<char> password = "N/A";

    for (int j = 0; j < 6; j++) {
        if (j == 0) line = pref.getString("wifiStr0").c_str();
        if (j == 1) line = pref.getString("wifiStr1").c_str();
        if (j == 2) line = pref.getString("wifiStr2").c_str();
        if (j == 3) line = pref.getString("wifiStr3").c_str();
        if (j == 4) line = pref.getString("wifiStr4").c_str();
        if (j == 5) line = pref.getString("wifiStr5").c_str();
        if (line.starts_with(ssid) && line[strlen(ssid)] == '\t') {
            int idx = line.index_of("\t", 0);
            password = line.substr(idx + 1);
        }
    }
    return password;
}

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    dlna.loop();
    vTaskDelay(1);
    audio.loop();
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    bt_emitter.loop();
    tft.loop();

    while (s_logBuffer.size() > 0) {
        size_t i = s_logBuffer.size();
        webSrv.send("serTerminal=", s_logBuffer[i - 1].c_get());
        s_logBuffer.pop_back();
        if (s_logBuffer.size() == 0) s_logBuffer.clear(); // Löscht alle Elemente und gibt den Speicher frei
    }

    if (s_f_dlnaBrowseServer) {
        s_f_dlnaBrowseServer = false;
        dlna.browseServer(s_currDLNAsrvNr, s_dlnaHistory[s_dlnaLevel].objId.c_get(), s_totalNumberReturned);
    }
    if (s_f_clearLogo) {
        s_f_clearLogo = false;
        clearLogo();
    }
    if (s_f_clearStationName) {
        s_f_clearStationName = false;
        clearStationName();
    }

    if (s_f_playlistEnabled) {
        if (!s_f_playlistNextFile) {
            if (!audio.isRunning() && !s_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                s_playlistTime = millis();
                s_f_playlistNextFile = true;
            }
        } else {
            if (s_playlistTime + 5000 < millis()) s_f_playlistNextFile = false;
        }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if (s_f_100ms) { // calls every 0.1 second
        s_f_100ms = false;

        if (s_state == RADIO && s_radioSubMenue == 0) VUmeter_RA.update(audio.getVUlevel());

        static uint8_t factor = 0;
        static bool    f_tc = false;
        if (factor > 0) {
            factor--;
        } else {
            if (s_timeCounter.timer > 0) {
                factor = s_timeCounter.factor;
                dispFooter.updateTC(s_timeCounter.timer);
                s_timeCounter.timer--;
                f_tc = true;
            } else {
                if (f_tc) {
                    f_tc = false;
                    dispFooter.updateTC(0);
                    if (s_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"

                    if (s_state == RADIO) {
                        if (!txt_RA_staName.isEnabled()) { txt_RA_staName.show(true, false); } // assume volBox is shown
                        if (s_radioSubMenue == 1) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                        if (s_radioSubMenue == 2) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                        if (s_radioSubMenue == 3) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // show Numbers from IR
                        if (s_radioSubMenue == 4) {
                            s_radioSubMenue = 0;
                            changeState(RADIO);
                        } // IR select mode
                    } else if (s_state == STATIONSLIST) {
                        s_radioSubMenue = 0;
                        changeState(RADIO);
                    } else if (s_state == PLAYER) {
                        if (!txt_PL_fName.isEnabled()) { txt_PL_fName.show(true, false); } // assume volBox is shown
                        if (s_playerSubMenue == 2) {
                            s_playerSubMenue = 0;
                            changeState(PLAYER);
                        }
                        if (s_playerSubMenue == 3) {
                            s_playerSubMenue = 1;
                            changeState(PLAYER);
                        }
                    } else if (s_state == AUDIOFILESLIST) {
                        s_playerSubMenue = 0;
                        changeState(PLAYER);
                    } else if (s_state == DLNA) {
                        if (!txt_DL_fName.isEnabled()) { txt_DL_fName.show(true, false); } // assume volBox is shown
                        if (s_dlnaSubMenue == 1) {
                            s_dlnaSubMenue = 0;
                            changeState(DLNA);
                        }
                    } else if (s_state == DLNAITEMSLIST) {
                        s_dlnaSubMenue = 0;
                        changeState(DLNA);
                    } else if (s_state == CLOCK) {
                        s_clockSubMenue = 0;
                        changeState(CLOCK);
                    } else if (s_state == ALARMCLOCK) {
                        s_alarmSubMenue = 0;
                        changeState(ALARMCLOCK);
                    } else if (s_state == SETTINGS) {
                        s_settingsSubMenue = 0;
                        changeState(SETTINGS);
                    } else if (s_state == BRIGHTNESS) {
                        s_brightnessSubMenue = 0;
                        changeState(BRIGHTNESS);
                    } else if (s_state == EQUALIZER) {
                        s_equalizerSubMenue = 0;
                        changeState(EQUALIZER);
                    } else {
                        ;
                    } // all other, do nothing
                }
            }
        }

