schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
// Events from audioI2S library
void my_audio_info(Audio::msg_t m) {
    switch (m.e) {
        case Audio::evt_info:
            if (endsWith(m.msg, "failed!")) {
                SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_YELLOW, m.msg);
                s_streamTitle.assignf(ANSI_ESC_ORANGE "%s", m.msg);
                s_f_newStreamTitle = true;
                s_f_webFailed = true;
                return;
            }
            if (startsWith(m.msg, "FLAC")) {
                SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, m.msg);
                return;
            }
            if (endsWith(m.msg, "Stream lost")) {
                SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_YELLOW, m.msg);
                return;
            }
            if (startsWith(m.msg, "authent")) {
                SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_GREEN, m.msg);
                return;
            }
            if (startsWith(m.msg, "StreamTitle=")) { return; }
            if (startsWith(m.msg, "HTTP/") && m.msg[9] > '3') {
                SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, m.msg);
                return;
            }
            if (startsWith(m.msg, "ERROR:")) {
                SerialPrintflnCut("AUDIO_info:  ", ANSI_ESC_RED, m.msg);
                return;
            }
            if (CORE_DEBUG_LEVEL >= ARDUHAL_LOG_LEVEL_WARN) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "%s", m.msg);
                return;
            } // all other
            break;

        case Audio::evt_name:
            s_stationName_air = m.msg; // set max length
            SerialPrintfln("StationName: " ANSI_ESC_MAGENTA "%s", m.msg);
            s_f_newStationName = true;
            break;

        case Audio::evt_streamtitle:
            s_streamTitle = m.msg;
            if (!s_f_irNumberSeen) s_f_newStreamTitle = true;
            SerialPrintfln("StreamTitle: " ANSI_ESC_YELLOW "%s", m.msg);
            break;

        case Audio::evt_eof:
            s_f_isWebConnected = false;
            s_f_eof = true;
            s_f_isFSConnected = false;
            SerialPrintflnCut("end of file: ", ANSI_ESC_YELLOW, m.msg);
            if (s_state == PLAYER) {
                webSrv.send("SD_playFile=", "end of audiofile");
                if (!s_f_playlistEnabled) {
                    s_f_clearLogo = true;
                    s_f_clearStationName = true;
                    s_playerSubMenue = 0;
                    changeState(PLAYER);
                }
            }
            if (s_state == RADIO) { clearWithOutHeaderFooter(); }
            if (s_state == DLNA) {
                txt_DL_fName.setText("");
                txt_DL_fName.show(true, false);
                btn_DL_pause.setActive(false);
                btn_DL_pause.show();
            }
            s_f_eof = true;
            break;

        case Audio::evt_lasthost:
            if (s_f_playlistEnabled) return;
            s_settings.lastconnectedhost.assign(m.msg);
            SerialPrintflnCut("lastURL: ..  ", ANSI_ESC_WHITE, s_settings.lastconnectedhost.get());
            webSrv.send("stationURL=", s_settings.lastconnectedhost.get());
            break;

        case Audio::evt_icyurl:
            if (strlen(m.msg) > 5) {
                SerialPrintflnCut("icy-url: ..  ", ANSI_ESC_WHITE, m.msg);
                s_homepage = m.msg;
                if (!s_homepage.starts_with("http")) s_homepage = "http://" + s_homepage;
            }
            break;

        case Audio::evt_icylogo:
            if (strlen(m.msg) > 5) { SerialPrintflnCut("icy-logo:    ", ANSI_ESC_WHITE, m.msg); }
            break;

        case Audio::evt_id3data: SerialPrintfln("id3data: ..  " ANSI_ESC_GREEN "%s", m.msg); break;

        case Audio::evt_image:
            for (int i = 0; i < m.vec.size(); i += 2) { SerialPrintfln("CoverImage:  " ANSI_ESC_GREEN "segment %02i, pos %08i, len %08i", i / 2, m.vec[i], m.vec[i + 1]); }
            break;

        case Audio::evt_icydescription:
            s_icyDescription = m.msg;
            s_f_newIcyDescription = true;
            if (strlen(m.msg)) SerialPrintfln("icy-descr:   %s", m.msg);
            break;

        case Audio::evt_bitrate:
            if (!strlen(m.msg)) return; // guard
            s_icyBitRate = str2int(m.msg);
            s_f_newBitRate = true;
            SerialPrintfln("bitRate:     " ANSI_ESC_GREEN "%i", s_icyBitRate);
            break;

        case Audio::evt_lyrics:
            SerialPrintfln("sync lyrics: " ANSI_ESC_CYAN "%s", m.msg);
            if (s_state == RADIO) showStreamTitle(m.msg); // web file
            if (s_state == PLAYER) showFileName(m.msg);
            break;

        case Audio::evt_log: SerialPrintfln("%s: .....  %s", m.s, m.msg); break;

        default: SerialPrintfln("message:...  %s", m.msg); break;
    }
}

// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void audio_process_i2s(int16_t* outBuff, uint16_t validSamples, bool* continueI2S) {

    // int16_t sineWaveTable[44] = {
    //      0,   3743,   7377,  10793,  14082,  17136,  19848,  22113,  23825,  24908,
    //   25311,  24908,  23825,  22113,  19848,  17136,  14082,  10793,   7377,   3743,
    //      0,  -3743,  -7377, -10793, -14082, -17136, -19848, -22113, -23825, -24908,
    //  -25311, -24908, -23825, -22113, -19848, -17136, -14082, -10793,  -7377,  -3743
    // };

    // static uint8_t tabPtr = 0;
    // int16_t* sample[2]; // assume 2 channels, 16bit
    // for(int i= 0; i < validSamples; i++){
    //     *(sample + 0) = outBuff + i * 2;     // channel left
    //     *(sample + 1) = outBuff + i * 2 + 1; // channel right

    //     *(*sample + 0) = (sineWaveTable[tabPtr] /50 + *(*sample + 0));
    //     *(*sample + 1) = (sineWaveTable[tabPtr] /50 + *(*sample + 1));
    //     tabPtr++;
    //     if(tabPtr == 44) tabPtr = 0;
    // }
    *continueI2S = true;
}
// ————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void ftp_debug(const char* info) {
    if (startsWith(info, "File Name")) return;
    SerialPrintfln("ftpServer:   %s", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from rtime library
void RTIME_info(const char* info) {
    SerialPrintfln("rtime_info:  %s", info);
}
// Events from tft library
void tft_info(const char* info) {
    SerialPrintfln("tft_info: .  %s", info);
}
// Events from tp library
void tp_info(const char* info) {
    SerialPrintfln("tp_info: ..  %s", info);
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from IR Library
void ir_code(uint8_t addr, uint8_t cmd) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "IR address " ANSI_ESC_BLUE "0x%02x, " ANSI_ESC_YELLOW "IR command " ANSI_ESC_BLUE "0x%02x", addr, cmd);
    char buf[20];
    sprintf(buf, "0x%02x", addr);
    webSrv.send("IR_address=", buf);
    sprintf(buf, "0x%02x", cmd);
    webSrv.send("IR_command=", buf);
}

