schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void ir_res(uint32_t res) {
    if (s_state != RADIO) return;
    if (s_f_sleeping == true) return;
    SerialPrintfln("ir_result:   " ANSI_ESC_YELLOW "Stationnumber " ANSI_ESC_BLUE "%lu", (long unsigned)res);
    s_f_irResultSeen = true;
    s_f_irNumberSeen = false;
    s_irResult = res;
    return;
}
void ir_number(uint16_t num) {
    if (s_state != RADIO) return;
    if (s_f_sleeping) return;
    s_f_irNumberSeen = true;
    s_irNumber = num;
    s_radioSubMenue = 3;
    changeState(RADIO);
}
void ir_short_key(uint8_t key) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "short pressed key nr: " ANSI_ESC_BLUE "%02i", key);
    if (s_f_sleeping == true && !s_f_irOnOff) {
        wake_up();
        return;
    }
    if (s_f_irOnOff == true && key != 20) return;
    if (s_state == IR_SETTINGS) return; // nothing todo
    static uint8_t btnNr = 0;
    switch (key) {
        case 10: // MUTE
            muteChanged(!s_f_mute);
            break;
        case 11: // ARROW RIGHT
            if (s_state == RADIO) {
                if (s_radioSubMenue < 4) {
                    nextFavStation();
                    return; // NEXT STATION
                }
                if (s_radioSubMenue == 4) {   // scroll forward
                    if (btnNr > 7) btnNr = 0; // guard
                    btnNr++;
                    if (btnNr == 1) {
                        btn_RA_staList.show();
                        btn_RA_player.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_RA_player.show();
                        btn_RA_dlna.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_RA_dlna.show();
                        btn_RA_clock.showAlternativePic();
                    }
                    if (btnNr == 4) {
                        btn_RA_clock.show();
                        btn_RA_sleep.showAlternativePic();
                    }
                    if (btnNr == 5) {
                        btn_RA_sleep.show();
                        btn_RA_settings.showAlternativePic();
                    }
                    if (btnNr == 6) {
                        btn_RA_settings.show();
                        btn_RA_bt.showAlternativePic();
                    }
                    if (btnNr == 7) {
                        btn_RA_bt.show();
                        btn_RA_off.showAlternativePic();
                    }
                    if (btnNr == 8) {
                        btn_RA_off.show();
                        btn_RA_staList.showAlternativePic();
                        btnNr = 0;
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == STATIONSLIST) { // next page
                lst_RADIO.nextPage();
                setTimeCounter(LIST_TIMER);
                return;
            }
            if (s_state == PLAYER) {
                if (s_playerSubMenue == 2) {  // scroll forward
                    if (btnNr > 7) btnNr = 0; // guard
                    btnNr++;
                    if (btnNr == 1) {
                        btn_PL_prevFile.show();
                        btn_PL_nextFile.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_PL_nextFile.show();
                        btn_PL_ready.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_PL_ready.show();
                        btn_PL_playAll.showAlternativePic();
                    }
                    if (btnNr == 4) {
                        btn_PL_playAll.show();
                        btn_PL_shuffle.showAlternativePic();
                    }
                    if (btnNr == 5) {
                        btn_PL_shuffle.show();
                        btn_PL_fileList.showAlternativePic();
                    }
                    if (btnNr == 6) {
                        btn_PL_fileList.show();
                        btn_PL_radio.showAlternativePic();
                    }
                    if (btnNr == 7) {
                        btn_PL_radio.show();
                        btn_PL_off.showAlternativePic();
                    }
                    if (btnNr == 8) {
                        btn_PL_off.show();
                        btn_PL_prevFile.showAlternativePic();
                        btnNr = 0;
                    }
                    setTimeCounter(2);
                    return;
                }
                if (s_playerSubMenue == 3) { // scroll forward (mute, pause, cancel, prev, next)
                    if (btnNr < 4) btnNr++;
                    if (btnNr == 1) {
                        btn_PL_mute.show();
                        btn_PL_pause.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_PL_pause.show();
                        btn_PL_cancel.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_PL_cancel.show();
                        btn_PL_playPrev.showAlternativePic();
                    }
                    if (btnNr == 4) {
                        btn_PL_playPrev.show();
                        btn_PL_playNext.showAlternativePic();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.nextPage();
                setTimeCounter(LIST_TIMER);
                return; // next page
            }
            if (s_state == DLNA) {
                if (s_dlnaSubMenue == 1) { // scroll forward (mute, pause, cancel, prev, next)
                    if (btnNr < 4) btnNr++;
                    if (btnNr == 1) {
                        btn_DL_mute.show();
                        btn_DL_pause.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_DL_pause.show();
                        btn_DL_cancel.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_DL_cancel.show();
                        btn_DL_fileList.showAlternativePic();
                    }
                    if (btnNr == 4) {
                        btn_DL_fileList.show();
                        btn_DL_radio.showAlternativePic();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == DLNAITEMSLIST) {
                //                        lst_DLNA.nextPage(); setTimeCounter(LIST_TIMER); return; // nextpage
            }
            if (s_state == CLOCK) {
                if (s_clockSubMenue == 2) { // scroll forward (alarm, radio, mute, off)
                    if (btnNr < 3) btnNr++;
                    if (btnNr == 1) {
                        btn_CL_alarm.show();
                        btn_CL_radio.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_CL_radio.show();
                        btn_CL_mute.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_CL_mute.show();
                        btn_CL_off.showAlternativePic();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == ALARMCLOCK) {
                if (s_alarmSubMenue == 1) { // scroll forward (left, right, up, down, ready)
                    if (btnNr < 4) btnNr++;
                    if (btnNr == 1) {
                        btn_AC_left.show();
                        btn_AC_right.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_AC_right.show();
                        btn_AC_up.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_AC_up.show();
                        btn_AC_down.showAlternativePic();
                    }
                    if (btnNr == 4) {
                        btn_AC_down.show();
                        btn_AC_ready.showAlternativePic();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == SLEEPTIMER) {
                if (s_sleepTimerSubMenue == 1) { // scroll forward (up, down, ready, cancel)
                    if (btnNr < 3) btnNr++;
                    if (btnNr == 1) {
                        btn_SL_up.show();
                        btn_SL_down.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_SL_down.show();
                        btn_SL_ready.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_SL_ready.show();
                        btn_SL_cancel.showAlternativePic();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == SETTINGS) {
                if (s_settingsSubMenue == 1) { // scroll forward (bright, equal, wifi, radio)
                    if (btnNr < 3) btnNr++;
                    if (btnNr == 1) {
                        btn_SE_bright.show();
                        btn_SE_equal.showAlternativePic();
                    }
                    if (btnNr == 2) {
                        btn_SE_equal.show();
                        btn_SE_wifi.showAlternativePic();
                    }
                    if (btnNr == 3) {
                        btn_SE_wifi.show();
                        btn_SE_radio.showAlternativePic();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == BRIGHTNESS) {
                if (s_brightnessSubMenue == 1) {
                    s_brightness += 5;
                    if (s_brightness > 100) s_brightness = 100;
                    sdr_BR_value.setValue(s_brightness);
                    setTimeCounter(2);
                }
            }
            if (s_state == EQUALIZER) {
                if (s_equalizerSubMenue == 1) {
                    char c[10];
                    if (btnNr == 10) {
                        if (s_tone.BAL < 16) {
                            s_tone.BAL++;
                            itoa(s_tone.BAL, c, 10);
                            txt_EQ_balance.writeText(c);
                            sdr_EQ_balance.setValue(s_tone.BAL);
                        }
                        webSrv.send("settone=", setI2STone().c_get());
                        setTimeCounter(2);
                        return;
                    } // balance
                    if (btnNr == 20) {
                        if (s_tone.LP < 6) {
                            s_tone.LP++;
                            itoa(s_tone.LP, c, 10);
                            txt_EQ_lowPass.writeText(c);
                            sdr_EQ_lowPass.setValue(s_tone.LP);
                        }
                        webSrv.send("settone=", setI2STone().c_get());
                        setTimeCounter(2);
                        return;
                    } // HP
                    if (btnNr == 30) {
                        if (s_tone.BP < 6) {
                            s_tone.BP++;
                            itoa(s_tone.BP, c, 10);
                            txt_EQ_bandPass.writeText(c);
                            sdr_EQ_bandPass.setValue(s_tone.BP);
                        }
                        webSrv.send("settone=", setI2STone().c_get());
                        setTimeCounter(2);
                        return;
                    } // BP
                    if (btnNr == 40) {
                        if (s_tone.HP < 6) {
                            s_tone.HP++;
                            itoa(s_tone.HP, c, 10);
                            txt_EQ_highPass.writeText(c);
                            sdr_EQ_highPass.setValue(s_tone.HP);
                        }
                        webSrv.send("settone=", setI2STone().c_get());
                        setTimeCounter(2);
                        return;
                    } // LP
                    if (btnNr == 1) {
                        btnNr = 2;
                        btn_EQ_Player.show();
                        btn_EQ_mute.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                    if (btnNr == 0) {
                        btnNr = 1;
                        btn_EQ_Radio.show();
                        btn_EQ_Player.showAlternativePic();
                        setTimeCounter(2);
                        return;
                    }
                }
            }
            break;
        case 12: // ARROW LEFT
            if (s_state == RADIO) {
                if (s_radioSubMenue < 4) {
                    prevFavStation();
                    return; // PREV STATION
                }
                if (s_radioSubMenue == 4) {   // scroll backward
                    if (btnNr > 7) btnNr = 0; // guard
                    if (btnNr == 0) btnNr = 8;
                    btnNr--;
                    if (btnNr == 0) {
                        btn_RA_staList.showAlternativePic();
                        btn_RA_player.show();
                    }
                    if (btnNr == 1) {
                        btn_RA_player.showAlternativePic();
                        btn_RA_dlna.show();
                    }
                    if (btnNr == 2) {
                        btn_RA_dlna.showAlternativePic();
                        btn_RA_clock.show();
                    }
                    if (btnNr == 3) {
                        btn_RA_clock.showAlternativePic();
                        btn_RA_sleep.show();
                    }
                    if (btnNr == 4) {
                        btn_RA_sleep.showAlternativePic();
                        btn_RA_settings.show();
                    }
                    if (btnNr == 5) {
                        btn_RA_settings.showAlternativePic();
                        btn_RA_bt.show();
                    }
                    if (btnNr == 6) {
                        btn_RA_bt.showAlternativePic();
                        btn_RA_off.show();
                    }
                    if (btnNr == 7) {
                        btn_RA_off.showAlternativePic();
                        btn_RA_staList.show();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == STATIONSLIST) {
                lst_RADIO.prevPage();
                setTimeCounter(LIST_TIMER);
                break;
            } // prev page
            if (s_state == PLAYER) {
                if (s_playerSubMenue == 2) {  // scroll backward
                    if (btnNr > 7) btnNr = 0; // guard
                    if (btnNr == 0) btnNr = 8;
                    btnNr--;
                    if (btnNr == 0) {
                        btn_PL_prevFile.showAlternativePic();
                        btn_PL_nextFile.show();
                    }
                    if (btnNr == 1) {
                        btn_PL_nextFile.showAlternativePic();
                        btn_PL_ready.show();
                    }
                    if (btnNr == 2) {
                        btn_PL_ready.showAlternativePic();
                        btn_PL_playAll.show();
                    }
                    if (btnNr == 3) {
                        btn_PL_playAll.showAlternativePic();
                        btn_PL_shuffle.show();
                    }
                    if (btnNr == 4) {
                        btn_PL_shuffle.showAlternativePic();
                        btn_PL_fileList.show();
                    }
                    if (btnNr == 5) {
                        btn_PL_fileList.showAlternativePic();
                        btn_PL_radio.show();
                    }
                    if (btnNr == 6) {
                        btn_PL_radio.showAlternativePic();
                        btn_PL_off.show();
                    }
                    if (btnNr == 7) {
                        btn_PL_off.showAlternativePic();
                        btn_PL_prevFile.show();
                    }
                    setTimeCounter(2);
                    return;
                }
                if (s_playerSubMenue == 3) { // scroll backward (mute, pause, cancel, prev, next)
                    if (btnNr > 0) btnNr--;
                    if (btnNr == 0) {
                        btn_PL_mute.showAlternativePic();
                        btn_PL_pause.show();
                    }
                    if (btnNr == 1) {
                        btn_PL_pause.showAlternativePic();
                        btn_PL_cancel.show();
                    }
                    if (btnNr == 2) {
                        btn_PL_cancel.showAlternativePic();
                        btn_PL_playPrev.show();
                    }
                    if (btnNr == 3) {
                        btn_PL_playPrev.showAlternativePic();
                        btn_PL_playNext.show();
                    }
                    setTimeCounter(2);
                    return;
                }
                if (s_cur_AudioFileNr > 0) {
                    s_cur_AudioFileNr--;
                    showFileName(s_SD_content.getColouredSStringByIndex(s_cur_AudioFileNr));
                    showAudioFileNumber();
                    return;
                }
            }
            if (s_state == AUDIOFILESLIST) {
                lst_PLAYER.prevPage();
                setTimeCounter(LIST_TIMER);
                break; // prev page
            }
            if (s_state == DLNA) {
                if (s_dlnaSubMenue == 1) { // scroll backward (mute, pause, cancel, prev, next)
                    if (btnNr > 0) btnNr--;
                    if (btnNr == 0) {
                        btn_DL_mute.showAlternativePic();
                        btn_DL_pause.show();
                    }
                    if (btnNr == 1) {
                        btn_DL_pause.showAlternativePic();
                        btn_DL_cancel.show();
                    }
                    if (btnNr == 2) {
                        btn_DL_cancel.showAlternativePic();
                        btn_DL_fileList.show();
                    }
                    if (btnNr == 3) {
                        btn_DL_fileList.showAlternativePic();
                        btn_DL_radio.show();
                    }
                    setTimeCounter(2);
                    return;
                }
            }
            if (s_state == DLNAITEMSLIST) {
                //                        lst_DLNA.prevPage(); setTimeCounter(LIST_TIMER); return; // prev page
            }

